PMo_manipulated/Graphviz/11.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ExclusiveGateway_6" -> "apply refund";
  "Set automatic\ntriggers for billing\ncycles" -> "ParallelGateway_5";
  "Send regular updates" -> "ParallelGateway_2";
  "ParallelGateway_1" -> "Assign access";
  "ExclusiveGateway_6" -> "apply charges";
  "ExclusiveGateway_4" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "Send renewal\nnotifications";
  "Generate account" -> "ParallelGateway_1";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3";
  "ParallelGateway_6" -> "ExclusiveGateway_2";
  "apply charges" -> "ExclusiveGateway_5";
  "Send product\nenhancements" -> "ParallelGateway_2";
  "ParallelGateway_4" -> "Send regular updates";
  "ParallelGateway_5" -> "ExclusiveGateway_4";
  "Assign access" -> "ParallelGateway_5";
  "Settle final account\nbalance" -> "ParallelGateway_6";
  "ExclusiveGateway_3" -> "ExclusiveGateway_2";
  "start" -> "Customer signs up";
  "ExclusiveGateway_6" -> "ExclusiveGateway_5";
  "ParallelGateway_3" -> "Deactivate\nsubscription";
  "ParallelGateway_1" -> "Set automatic\ntriggers for billing\ncycles";
  "ExclusiveGateway_2" -> "end";
  "Send renewal\nnotifications" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "Customer submits\ncancellation request";
  "ParallelGateway_3" -> "ExclusiveGateway_6";
  "Customer submits\ncancellation request" -> "ParallelGateway_3";
  "apply refund" -> "ExclusiveGateway_5";
  "ExclusiveGateway_5" -> "Settle final account\nbalance";
  "ParallelGateway_2" -> "ExclusiveGateway_1";
  "Deactivate\nsubscription" -> "ParallelGateway_6";
  "ParallelGateway_4" -> "Send product\nenhancements";
  "Customer signs up" -> "Generate account";
  "ExclusiveGateway_5" -> "ExclusiveGateway_2";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
  "ParallelGateway_5" [label="+", shape=diamond];
  "ParallelGateway_6" [label="+", shape=diamond];
}
